import image1 from "@/assets/level-test/image-1.jpg";
import image2 from "@/assets/level-test/image-2.jpg";
import image3 from "@/assets/level-test/image-3.jpg";
import image4 from "@/assets/level-test/image-4.jpg";
import image5 from "@/assets/level-test/image-5.jpg";
import image6 from "@/assets/level-test/image-6.jpg";
import image7 from "@/assets/level-test/image-7.jpg";

export const QUESTIONS = [
  {
    questionText: "В състава на хиалуроновата киселина участват макроелементите:",
    answers: [
      "С, Н, Сu, S",
      "C, O, H, N",
      "O, N, Zn, C",
      "N, P, B, O"
    ],
    correctAnswerId: 1
  },
  {
    questionText: "Холестеролът, за разлика от тестостерона, е:",
    answers: [
      "стероид",
      "пръстеновидна молекула",
      "неразтворим във вода",
      "в плазмалемата на животинска клетка"
    ],
    correctAnswerId: 3
  },
  {
    questionText: "Основна структурна единица на хроматина е:",
    answers: [
      "нуклеотидът",
      "нуклеоидът",
      "нуклозидът",
      "нуклеозомата"
    ],
    correctAnswerId: 3
  },
  {
    questionText: "Калиево-натриевата помпа е белтък, който:",
    answers: [
      "извършва симпорт на Na⁺ и К⁺",
      "осъществява антипорт на Na⁺ и К⁺",
      "не използва АТФ за функционирането",
      "транспортира вещества по посока на концентрационния градиент"
    ],
    correctAnswerId: 1
  },
  {
    questionText: "В цикъла на Кребс:",
    answers: [
      "ацетил КоА се свързва с лимонената киселина",
      "протичат три окислителни стъпала",
      "се осъществява окислително фосфорилиране",
      "се възстановява оксалоцетната киселина"
    ],
    correctAnswerId: 3
  },
  {
    questionText: "При процеса, означен на фигурата с цифра 2, молекулата се:",
    answers: [
      "хибридизира",
      "хидролизира",
      "денатурира",
      "ренатурира"
    ],
    correctAnswerId: 3,
    image: image1
  },
  {
    questionText: "Пероксизомите за разлика от лизозомите:",
    answers: [
      "са едномембранни органели",
      "съдържат АТФ синтаза",
      "обезвреждат токсични вещества",
      "нарастват при хетерофагия и автофагия"
    ],
    correctAnswerId: 3
  },
  {
    questionText: "Делителният апарат в клетките на висшите растения, за разлика от този в животинските клетки, НЕ включва:",
    answers: [
      "цитоцентър",
      "микротръбички",
      "полюсни нишки",
      "кинетохорни нишки"
    ],
    correctAnswerId: 0,
  },
  {
    questionText: "Изображението показва отклонения от нормалното развитие на жлеза в човешкото тяло. Възможна причина за това е недостиг на химичния елемент:",
    answers: [
      "I",
      "Cl",
      "Na",
      "Fe"
    ],
    correctAnswerId: 0,
    image: image2
  },
  {
    questionText: "Комуникативни контакти в растителните клетки са:",
    answers: [
      "плазмодезмите",
      "десмозомите",
      "конексоните",
      "синапсите"
    ],
    correctAnswerId: 0,
  },
  {
    questionText: "Резултат от клетъчната диференциация е:",
    answers: [
      "формирането на различните видове тъкани в даден организъм",
      "поддържането на генетичното разнообразие в популациите",
      "образуването на нови клетъчни популации",
      "появата на тумори"
    ],
    correctAnswerId: 0,
  },
  {
    questionText: "Стадий какавида се наблюдава при:",
    answers: [
      "прякото развитие на индивида",
      "ембрионалното развитие",
      "непълната метаморфоза",
      "пълната метаморфоза"
    ],
    correctAnswerId: 3,
  },
  {
    questionText: "Транспирацията при растенията се осъществява с участието на структурите, означени с цифра:",
    answers: [
      "1",
      "2",
      "3",
      "4"
    ],
    correctAnswerId: 0,
    image: image3
  },
  {
    questionText: "В кое кръстосване разпадането по фенотип и по генотип е 1:1:1:1?",
    answers: [
      "ААBB x aabb",
      "АaBB x AaBb",
      "AaBb x aabb",
      "ААBb x aabb"
    ],
    correctAnswerId: 2,
  },
  {
    questionText: "Какъв начин на размножаване е илюстриран на схемата?",
    answers: [
      "соматична ембриогенеза",
      "партеногенеза",
      "клониране",
      "полово"
    ],
    correctAnswerId: 2,
    image: image4
  },
  {
    questionText: "В дихателните органи на човека посоката на издишания въздух е в следната последователност:",
    answers: [
      "1 → 2 → 3",
      "2 → 3 → 1",
      "3 → 2 → 1",
      "2 → 1 → 3"
    ],
    correctAnswerId: 2,
    image: image5
  },
  {
    questionText: "Кои от дадените жлези са само ендокринни?",
    answers: [
      "слюнчени, чревни, околощитовидни",
      "потни, надбъбречни, стомашни",
      "щитовидна, панкреас, простата",
      "хипофиза, епифиза, тимус"
    ],
    correctAnswerId: 3,
  },
  {
    questionText: "Какъв вид е описаното поведение на възрастните птици?",
    suptext: "При императорските пингвини женската снася едно яйце навътре в сушата." +
    "Първоначално то се мъти от мъжкия индивид, а женската се връща до океана за" +
    "храна. Ако малкото се излюпи преди връщането на женската, мъжкият пингвин" +
    "отделя от хранопровода си вещество, подобно на мляко, с което изхранва малкото до" +
    "идването на женската. Двамата родители се редуват в изхранването на новоизлюпеното птиче.",
    answers: [
      "ловно",
      "хранително",
      "родителско",
      "кооперация"
    ],
    correctAnswerId: 2,
  },
  {
    questionText: "Монозомия на половите хромозоми е причина за синдрома на:",
    answers: [
      "Даун",
      "Патау",
      "Търнър",
      "Едуардс"
    ],
    correctAnswerId: 2,
  },
  {
    questionText: "Териториалните групировки на големия синигер се означават като:",
    suptext: "Видът голям синигер обитава обширни територии от Европа и Азия и е" +
    "представен чрез пет основни групи. Индивидите във всяка от тях се отличават от" +
    "останалите по сроковете и темповете на размножаване, реакцията им към" +
    "климатичните фактори на средата и са изолирани от труднопреодолими бариери на релефа."
    ,
    answers: [
      "полупопулации",
      "псевдопопулации",
      "географски популации",
      "екологични популации"
    ],
    correctAnswerId: 2,
  },
  {
    questionText: "Коя от екосистемите НЕ може да достигне състояние на климакс?",
    answers: [
      "горската",
      "ливадната",
      "океанската",
      "агросистемата"
    ],
    correctAnswerId: 3,
  },
  {
    questionText: "Ценогенезата, довела до господството на бозайниците през неозойска ера, е:",
    answers: [
      "космената покривка",
      "диференцираните зъби",
      "междукамерната преграда",
      "плацентата"
    ],
    correctAnswerId: 3,
  },
  {
    questionText: "Какво видообразуване е довело до появата на новия вид пъстрокрилка?",
    suptext: "Пъстрокрилката е паразит върху видове от семейство Глогови. В същите райони" +
    "от 1864 г. е забелязан вид, който паразитира върху зимни сортове ябълки, а от 1960 г." +
    "– нова раса, паразитираща върху вишните.",
    answers: [
      "алопатрично",
      "симпатрично",
      "филетично",
      "паралелно"
    ],
    correctAnswerId: 1,
  },
  {
    questionText: "Появата на зебрата, магарето и коня от далечен общ предшественик е пример за:",
    answers: [
      "конвергенция",
      "паралелизъм",
      "дивергенция",
      "коеволюция"
    ],
    correctAnswerId: 2,
  },
  {
    questionText: "Кой вид естествен отбор представя моделът?",
    answers: [
      "движещ",
      "дизруптивен",
      "стабилизиращ",
      "конституционен"
    ],
    correctAnswerId: 1,
    image: image6
  },
  {
    questionText: "Изберете верните твърдения за процесите, представени на модела.",
    subtext: "1) Моделът представя алостерично инхибиране.\n" +
    "2) Ефекторът се свързва с активния център на ензима.\n" +
    "3) Ензимът променя нативната си конформация.\n" + 
    "3) Ензимът променя нативната си конформация.",
    answers: [
      "само 1 и 2",
      "само 1 и 3",
      "1, 2 и 4",
      "1, 2 и 3"
    ],
    correctAnswerId: 1,
    image: image7
  },
  {
    questionText: "Клетъчни структури, участващи във възстановяване на тъкани и органи са:",
    subtext: "1) хетерохроматин\n2) еухроматин\n3) цитоцентър\n4) полизома",
    answers: [
      "1 и 3 ",
      "само 2 и 4",
      "само 2 и 3",
      "2, 3 и 4"
    ],
    correctAnswerId: 3,
  },
  {
    questionText: "Култивирането на млечно-кисели бактерии е в основата на биотехнологичните производства. Важни условия за осъществяването на процеса са:",
    subtext: "1) подходяща температура\n2) хранителна среда\n3) стерилна среда\n4) светлина",
    answers: [
      "само 1 и 2",
      "само 3 и 4",
      "1, 2 и 3",
      "2, 3 и 4"
    ],
    correctAnswerId: 2,
  },
  {
    questionText: "Вътрехромозомни мутации са:",
    subtext: "1) инверсиите\n2) инсерциите\n3) дупликациите\n4) транслокациите",
    answers: [
      "само 1 и 2",
      "само 1 и 3",
      "1, 2 и 3",
      "2, 3 и 4"
    ],
    correctAnswerId: 1,
  },
  {
    questionText: "Молекулни болести са:",
    subtext: "1) котешко мяукане\n2) фенилкетонурия\n3) муковисцидоза\n4) таласемия",
    answers: [
      "само 1 и 2",
      "само 3 и 4",
      "1, 2 и 4",
      "2, 3 и 4"
    ],
    correctAnswerId: 3,
  },
  {
    questionText: "Жлези с храносмилателни функции са:",
    subtext: "1) подезична\n2) околоушна\n3) подчелюстна\n4) околощитовидна",
    answers: [
      "само 1 и 2",
      "само 1 и 3",
      "само 1, 2 и 3",
      "1, 2, 3 и 4"
    ],
    correctAnswerId: 2,
  },
  {
    questionText: "При подагра се натрупват кристалчета пикочна киселина в ставите. С кои методи може да бъде диагностицирана болестта?",
    subtext: "1) ангиография\n2) рентгенография\n3) електроенцефалограма\n4) биохимичен анализ на кръвта",
    answers: [
      "само 1 и 2",
      "само 2 и 4",
      "само 3 и 4",
      "1, 2 и 3"
    ],
    correctAnswerId: 1,
  },
  {
    questionText: "Анализирайте информацията в текста и изберете верните твърдения за настъпилите последствия.",
    suptext: "Преди време Аралско море е било четвъртият по големина безотточен воден"+
    "резервоар на Земята, богат на разнообразни биологични видове. Днес е известно, като" +
    "„Море от пясък“, вследствие на намалелия приток на двете големи реки, вливащи се в" +
    "него – Амударя и Сърдаря. Техните води са отклонени за напояване на памучните" +
    "полета на Узбекистан и Туркменистан.",
    subtext: "1) Солеността на Аралско море се повишава.\n" +
    "2) Климатът в региона става по-континентален.\n" +
    "3) Уловът на шаран, есетра, херинга се увеличава.\n" +
    "4) Безработицата в съседните на морето страни се повишава.",
    answers: [
      "1, 2 и 3",
      "1, 2 и 4",
      "1, 3 и 4",
      "2, 3 и 4"
    ],
    correctAnswerId: 1,
  },
  {
    questionText: "Появата на кои от органелите в еукариотната клетка се обясняват с инвагинационната хипотеза?",
    subtext: "1) едномембранни органели\n2) цитоскелет\n3) рибозоми\n4) ядро",
    answers: [
      "1 и 2",
      "1 и 4",
      "2 и 3",
      "3 и 4"
    ],
    correctAnswerId: 1,
  },
  {
    questionText: "Кои фактори ще повлияят бъдещата еволюция на човека?",
    subtext: "1) метисация\n2) глобализация\n3) трансформация\n4) компартментализация",
    answers: [
      "само 1 и 2",
      "само 2 и 3",
      "само 1, 2 и 3",
      "1, 2, 3, 4"
    ],
    correctAnswerId: 0,
  },
];
