import image1 from "@/assets/level-test/image-1.jpg";
import image2 from "@/assets/level-test/image-2.jpg";
import image3 from "@/assets/level-test/image-3.jpg";
import image4 from "@/assets/level-test/image-4.jpg";

export const QUESTIONS = [
  {
    questionText: "В състава на хиалуроновата киселина участват макроелементите:",
    answers: [
      "С, Н, Сu, S",
      "C, O, H, N",
      "O, N, Zn, C",
      "N, P, B, O"
    ],
    correctAnswerIndex: 1
  },
  {
    questionText: "Холестеролът, за разлика от тестостерона, е:",
    answers: [
      "стероид",
      "пръстеновидна молекула",
      "неразтворим във вода",
      "в плазмалемата на животинска клетка"
    ],
    correctAnswerIndex: 3
  },
  {
    questionText: "Основна структурна единица на хроматина е:",
    answers: [
      "нуклеотидът",
      "нуклеоидът",
      "нуклозидът",
      "нуклеозомата"
    ],
    correctAnswerIndex: 3
  },
  {
    questionText: "В цикъла на Кребс:",
    answers: [
      "ацетил КоА се свързва с лимонената киселина",
      "протичат три окислителни стъпала",
      "се осъществява окислително фосфорилиране",
      "се възстановява оксалоцетната киселина"
    ],
    correctAnswerIndex: 3
  },
  {
    questionText: "При процеса, означен на фигурата с цифра 2, молекулата се:",
    answers: [
      "хибридизира",
      "хидролизира",
      "денатурира",
      "ренатурира"
    ],
    correctAnswerIndex: 3,
    image: image1
  },
  {
    questionText: "Пероксизомите за разлика от лизозомите:",
    answers: [
      "са едномембранни органели",
      "съдържат АТФ синтаза",
      "обезвреждат токсични вещества",
      "нарастват при хетерофагия и автофагия"
    ],
    correctAnswerIndex: 3
  },
  {
    questionText: "Делителният апарат в клетките на висшите растения, за разлика от този в животинските клетки, НЕ включва:",
    answers: [
      "цитоцентър",
      "микротръбички",
      "полюсни нишки",
      "кинетохорни нишки"
    ],
    correctAnswerIndex: 0,
  },
  {
    questionText: "Изображението показва отклонения от нормалното развитие на жлеза в човешкото тяло. Възможна причина за това е недостиг на химичния елемент:",
    answers: [
      "I",
      "Cl",
      "Na",
      "Fe"
    ],
    correctAnswerIndex: 0,
    image: image2
  },
  {
    questionText: "Стадий какавида се наблюдава при:",
    answers: [
      "прякото развитие на индивида",
      "ембрионалното развитие",
      "непълната метаморфоза",
      "пълната метаморфоза"
    ],
    correctAnswerIndex: 3,
  },
  {
    questionText: "В кое кръстосване разпадането по фенотип и по генотип е 1:1:1:1?",
    answers: [
      "ААBB x aabb",
      "АaBB x AaBb",
      "AaBb x aabb",
      "ААBb x aabb"
    ],
    correctAnswerIndex: 2,
  },
  {
    questionText: "В дихателните органи на човека посоката на издишания въздух е в следната последователност:",
    answers: [
      "1 → 2 → 3",
      "2 → 3 → 1",
      "3 → 2 → 1",
      "2 → 1 → 3"
    ],
    correctAnswerIndex: 2,
    image: image3
  },
  {
    questionText: "Кои от дадените жлези са само ендокринни?",
    answers: [
      "слюнчени, чревни, околощитовидни",
      "потни, надбъбречни, стомашни",
      "щитовидна, панкреас, простата",
      "хипофиза, епифиза, тимус"
    ],
    correctAnswerIndex: 3,
  },
  {
    questionText: "Териториалните групировки на големия синигер се означават като:",
    suptext: "Видът голям синигер обитава обширни територии от Европа и Азия и е" +
    "представен чрез пет основни групи. Индивидите във всяка от тях се отличават от" +
    "останалите по сроковете и темповете на размножаване, реакцията им към" +
    "климатичните фактори на средата и са изолирани от труднопреодолими бариери на релефа."
    ,
    answers: [
      "полупопулации",
      "псевдопопулации",
      "географски популации",
      "екологични популации"
    ],
    correctAnswerIndex: 2,
  },
  {
    questionText: "Какво видообразуване е довело до появата на новия вид пъстрокрилка?",
    suptext: "Пъстрокрилката е паразит върху видове от семейство Глогови. В същите райони" +
    "от 1864 г. е забелязан вид, който паразитира върху зимни сортове ябълки, а от 1960 г." +
    "– нова раса, паразитираща върху вишните.",
    answers: [
      "алопатрично",
      "симпатрично",
      "филетично",
      "паралелно"
    ],
    correctAnswerIndex: 1,
  },
  {
    questionText: "Изберете верните твърдения за процесите, представени на модела.",
    subtext: "1) Моделът представя алостерично инхибиране.\n" +
    "2) Ефекторът се свързва с активния център на ензима.\n" +
    "3) Ензимът променя нативната си конформация.\n" + 
    "3) Ензимът променя нативната си конформация.",
    answers: [
      "само 1 и 2",
      "само 1 и 3",
      "1, 2 и 4",
      "1, 2 и 3"
    ],
    correctAnswerIndex: 1,
    image: image4
  },
  {
    questionText: "Култивирането на млечно-кисели бактерии е в основата на биотехнологичните производства. Важни условия за осъществяването на процеса са:",
    subtext: "1) подходяща температура\n2) хранителна среда\n3) стерилна среда\n4) светлина",
    answers: [
      "само 1 и 2",
      "само 3 и 4",
      "1, 2 и 3",
      "2, 3 и 4"
    ],
    correctAnswerIndex: 2,
  },
  {
    questionText: "Вътрехромозомни мутации са:",
    subtext: "1) инверсиите\n2) инсерциите\n3) дупликациите\n4) транслокациите",
    answers: [
      "само 1 и 2",
      "само 1 и 3",
      "1, 2 и 3",
      "2, 3 и 4"
    ],
    correctAnswerIndex: 1,
  },
  {
    questionText: "Молекулни болести са:",
    subtext: "1) котешко мяукане\n2) фенилкетонурия\n3) муковисцидоза\n4) таласемия",
    answers: [
      "само 1 и 2",
      "само 3 и 4",
      "1, 2 и 4",
      "2, 3 и 4"
    ],
    correctAnswerIndex: 3,
  },
  {
    questionText: "Жлези с храносмилателни функции са:",
    subtext: "1) подезична\n2) околоушна\n3) подчелюстна\n4) околощитовидна",
    answers: [
      "само 1 и 2",
      "само 1 и 3",
      "само 1, 2 и 3",
      "1, 2, 3 и 4"
    ],
    correctAnswerIndex: 2,
  },
];

export function getDefaultAnswersResults() {
  const results = new Map();
  for (let index = 1; index <= 19; index++) {
    results.set(index, { questionNumber: index, answerCorrect: false });
  }
  return results;
}
